BI Publisher - runReport

WSDL
https://test.oraclecloud.com/xmlpserver/services/PublicReportService?wsdl

Request
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
   <soapenv:Header/>
   <soapenv:Body>
      <pub:runReport>
         <pub:reportRequest>
            <pub:attributeFormat>XML</pub:attributeFormat>
            <pub:attributeLocale></pub:attributeLocale>
            <pub:attributeTemplate></pub:attributeTemplate>
            <pub:reportAbsolutePath>/Custom/%Report.xdo</pub:reportAbsolutePath>
            <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
         </pub:reportRequest>
         <pub:userID>00000/pub:userID>
         <pub:password>00000</pub:password>
      </pub:runReport>
   </soapenv:Body>
</soapenv:Envelope>

Response
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <runReportResponse xmlns="http://xmlns.oracle.com/oxp/service/PublicReportService">
         <runReportReturn>
            <reportBytes>Ph0K</reportBytes>
            <reportContentType>text/xml</reportContentType>
            <reportFileID xsi:nil="true"/>
            <reportLocale xsi:nil="true"/>
         </runReportReturn>
      </runReportResponse>
   </soapenv:Body>
</soapenv:Envelope>
